\chapter{Basic Cisco Catalyst Switch Configuration}
\section{Port Addressing}
The addressing of ports on a Cisco Catalyst Switch follows the format:

\vspace{-5pt}
\begin{center}
	\verb|interface-type Stack #/Card #/Port #|
\end{center}
\vspace{-5pt}

\noindent
Let us consider the \textbf{Catalyst 3750} switch. This switch isn't modular and thus can't have multiple cards, but it supports Stack-wise, which is a Cisco technology to combine multiple physical switches in a stack into a single logical switch. Thus, the middle number when referring to a particular interface (i.e., port on a physical switch) will \textbf{always be 0}. Thus, the Giga-bit port that's $16^{th}$ port on the $3^{rd}$ stack member of switches will be written as: \verb|GigabitEthernet 3/0/16|, or \textbf{g3/0/16} for short. 

For a \textbf{Cisco 2960} switch, there's no option for Stack-wise, and hence we don't need the first number. Then, the name for the interface becomes \verb|GigabitEthernet 0/16| or \textbf{g0/16}.

\section{Configuring a Management IP Address}
We can connect to the switch physically via the console port, or through one of the interfaces using Ethernet. In case of the later, we have to set up a management IP address through which we can use telnet or SSH to control and configure the switch. 

\subsection{View how we're connected to a Switch}
To view how we're presently connected to a switch, we can use the \verb|show line| command: 

\vspace{-15pt}
\begin{minted}{console}
sw1>show line
   Tty Typ     Tx/Rx    A Modem  Roty AccO AccI   Uses   Noise  Overruns   Int
*    0 CTY              -    -      -    -    -      0       0     0/0       -
	 1 AUX   9600/9600  -    -      -    -    -      0       0     0/0       -
	 2 VTY              -    -      -    -    -      1       0     0/0       -
	 3 VTY              -    -      -    -    -      0       0     0/0       -
	 4 VTY              -    -      -    -    -      0       0     0/0       -
	 5 VTY              -    -      -    -    -      0       0     0/0       -
	 6 VTY              -    -      -    -    -      0       0     0/0       -
\end{minted}
\vspace{-10pt}

\noindent
The \textbf{asterisk (*)} at the beginning of the line shows that it's the port currently being used. The \textbf{CTY} refers to a console port, which is the port we're using. If we were using telnet or SSH, i.e., log in remotely to the switch/router, then one of the \textbf{VTY} (\textit{Virtual Terminal}) would've been used. 

\subsection{Privileged mode, auto-completion and showing possible commands}
The \verb|>| sign at the end of the prompt signals that we're currently in \textit{user mode}. To change the configuratin on the equipment we need to be in \textit{Privileged mode}, which is indicated by a \verb|#| prompt. To enter the privileged mode, we use the command \verb|enable|. To leave the privileged mode, we use \verb|disable|:

\vspace{-15pt}
\begin{minted}{console}
sw1>enable
sw1#disable
sw1>
\end{minted}
\vspace{-10pt}

\noindent
To go into privileged mode, we need not type the entire command. Cisco \textbf{IOS} (\textit{Internetwork Operating System}) can show all possible commands that can follow the current string on the present line on pressing the \verb|?| key. For example: 

\vspace{-15pt}
\begin{minted}{console}
sw1>e?
enable  ethernet  exit

sw1>en?
enable
\end{minted}
\vspace{-10pt}

\noindent
This also means that we don't need to type out the entire command. We can simply use short-cuts for the commands, which are the minimum number of letters in the word of a command that is unique. Thus, in the case of the \verb|enable|, the minimum characters required are 2 since there are 3 commands starting with 'e' but only 1 starting with 'en', i.e., \verb|enable|. 

\vspace{-15pt}
\begin{minted}{console}
sw1>en
sw1#
\end{minted}
\vspace{-10pt}

\subsection{Configuring the Terminal}
While we may be in privileged mode, we still need to tell the switch that we want to configure from the terminal. For this, we use the command \verb|configure terminal|, or \textbf{conf t} for short. This would bring us into the \textbf{global config} mode:

\vspace{-15pt}
\begin{minted}{console}
sw1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
sw1(config)#
\end{minted}
\vspace{-10pt}

\noindent
To exit the global configuration mode, we use the \verb|exit| command:

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#exit
sw1#
*Nov 11 21:36:07.353: %SYS-5-CONFIG_I: Configured from console by console
sw1#
\end{minted}
\vspace{-10pt}

\subsection{Interface Configuration Mode}
To set the management IP address we need to go to the interface configuration port. On a Cisco Switch, unlike on a PC/Laptop, every interface gets associated to the IP address which is of the network it's connected to. Layer-2 Switches are generally blind to the IP addresses since they don't make forwarding decisions on the basis of IP addresses, but this IP Address is required to be associated with the switch to uniquely identify the switch on the network for remote access through telnet/SSH. 

By default, on the switch, all the ports belong to a specific \textbf{VLAN\textit{(Virtual LAN)}}. Thus, we can set the IP address of the \textit{default VLAN}, \textbf{vlan1}, to set up the management IP address of the switch. To enter the interface configuration for vlan1, we use: \verb|interface vlan1|, or simply \textbf{int vlan1} :

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#int vlan 1
sw1(config-if)#
\end{minted}
\vspace{-10pt}

\noindent
The prompt changed to \verb|(config-if)#| to show that we've now entered the \textit{Interface config mode}.

\subsection{Adding a Management IP}
Just like with a PC, we need to set up both the IP address as well as the Subnet Mask. Let us consider the switch needs to have the IP \textbf{192.168.1.11/24}. We can't enter the value in suffix notation. The equivalent subnet mask is \textit{255.255.255.0}. Thus, the command becomes:

\vspace{-15pt}
\begin{minted}{console}
sw1(config-if)#ip add 192.168.1.11 255.255.255.0
sw1(config-if)#no shutdown
sw1(config-if)#
*Nov 11 21:51:57.295: %LINK-3-UPDOWN: Interface Vlan1, changed state to up
*Nov 11 21:51:58.298: %LINEPROTO-5-UPDOWN: Line protocol on Interface Vlan1, changed state to up
sw1(config-if)#
\end{minted}
\vspace{-10pt}

\noindent
Typically the interface \verb|vlan1| (i.e, the 1st virtual LAN) is turned on by default, but sometimes it may have been administratively shut-down, which we can fix using \verb|no shutdown| command, or for short \textbf{no shut}.

\section{Configuring a Default Gateway}
A default gateway is required for the switch to determine which path to take to exit it's own subnet and reach another network. While the IP address has to be set for an interface, the default gateway has to be set in global config mode:

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#ip default-gateway 192.168.1.1
\end{minted}
\vspace{-10pt}

\section{Setting Console and VTY Passwords}
To set the password for the console port login, we need to enter its configuration, i.e., console line configuration, and then set the password. Let's say we want to set it to \textit{cisco}. We can do this by:

\vspace{-15pt}
\begin{minted}{console}
sw1(config-line)#password cisco
sw1(config-line)#login
\end{minted}
\vspace{-10pt}

\noindent
The \verb|login| command enables the password check at login. Unless it's set, even if there's a valid password, the system won't ask for credentials while logging in. Further, to disable password check, we don't have to change/remove the password. we simply need to do \verb|no login|. The login command doesn't work unless there's a password set:

\vspace{-15pt}
\begin{minted}{console}
sw1(config-line)#login
% Login disabled on line 0, until 'password' is set
\end{minted}
\vspace{-10pt}

\subsection{Configuring a password for the VTY lines}
We could set the password for each VTY line individually, but if we're setting them (or a subset of them) all to an identical config, we can use:

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#line vty 0 5
sw1(config-line)#password cisco
sw1(config-line)#login
sw1(config-line)#end
sw1#
\end{minted}
\vspace{-10pt}

\noindent
This is assuming we want to set the password for lines 0-5 and not 6 of the available VTY lines. Also notice that we jump levels till we end the configuration of the switch by using \verb|end| command. Unlike the \verb|exit| command, the \verb|end| command doesn't just jump up to the parent config level, but ends the configuration all together and takes us out of the configuration mode all together. 

\section{Show Running Configuration}
To see the current configuration we created (but not yet saved), i.e., the configuration that the device is currently using, we use the command: 

\vspace{-15pt}
\begin{minted}{console}
sw1#sh run
Building configuration...

Current configuration : 2911 bytes
!
! Last configuration change at 22:48:16 UTC Sun Nov 11 2018
!
version 15.2
service timestamps debug datetime msec
service timestamps log datetime msec
no service password-encryption
service compress-config
!
hostname sw1
...
!
interface Vlan1
 ip address 192.168.1.11 255.255.255.0
!
ip default-gateway 192.168.1.1
ip forward-protocol nd
!
...
!
line con 0
 exec-timeout 0 0
 password cisco
 login
line aux 0
line vty 0 4
 password cisco
 login
line vty 5
 password cisco
 login
line vty 6
 login
!
!
end

sw1#
\end{minted}
\vspace{-10pt}

\noindent
At the very bottom we have the details for the console and the VTY lines. It's completely normal for IOS to break down the configuration for 0-6 into ranges (0-4,5,6), even though we configured them together at the same time. 

\section{Checking for connectivity using Ping}
The \verb|ping| command sends \textbf{ICMP (\textit{Internet Control Message Protocol})} packets to the destination device and waits for \textit{ICMP replies} from it to determine whether the host is up. It can help detect delays and packet drops, and whether the host is even connected i.e., reachable. We can use it by:

\vspace{-15pt}
\begin{minted}{console}
PC-1> ping 192.168.1.11
84 bytes from 192.168.1.11 icmp_seq=1 ttl=255 time=3.973 ms
84 bytes from 192.168.1.11 icmp_seq=2 ttl=255 time=3.969 ms
84 bytes from 192.168.1.11 icmp_seq=3 ttl=255 time=5.951 ms
84 bytes from 192.168.1.11 icmp_seq=4 ttl=255 time=3.472 ms
84 bytes from 192.168.1.11 icmp_seq=5 ttl=255 time=10.913 ms
\end{minted}
\vspace{-10pt}

\noindent
Some variation of the ping command is available on all major OS (Operating Systems). 

\section{Enabling Telnet Access}
Telnet is considered a non-secure method of accessing network equipment since data is sent in plain text and packet capture utils like wireshark can capture the traffic and get access to all the data. Thus \textbf{SSH (\textit{Secure Shell})} is considered a much better alternative. 

\subsection{Show line details}
To see the details of the VTY/CTY line, we use:

\vspace{-15pt}
\begin{minted}{console}
sw1#sh line vty 0
   Tty Typ     Tx/Rx    A Modem  Roty AccO AccI   Uses   Noise  Overruns   Int
     2 VTY              -    -      -    -    -      1       0     0/0       -

Line 2, Location: "", Type: ""
Length: 24 lines, Width: 80 columns
Baud rate (TX/RX) is 9600/9600
Status: Ready, No Exit Banner
Capabilities: none
Modem state: Ready
Group codes:    0
Special Chars: Escape  Hold  Stop  Start  Disconnect  Activation
                ^^x    none   -     -       none
Timeouts:      Idle EXEC    Idle Session   Modem Answer  Session   Dispatch
               00:10:00        never                        none     not set
                            Idle Session Disconnect Warning
                              never
                            Login-sequence User Response
                             00:00:30
                            Autoselect Initial Wait
                              not set
Modem type is unknown.
Session limit is not set.
Time since activation: never
Editing is enabled.
History is enabled, history size is 20.
DNS resolution in show commands is enabled
Full user help is disabled
Allowed input transports are lat pad telnet rlogin nasi ssh.
Allowed output transports are lat pad telnet rlogin nasi ssh.
Preferred transport is lat.
Shell: enabled
Shell trace: off
No output characters are padded
No special data dispatching characters
\end{minted}
\vspace{-10pt}

\noindent
The two lines of special interest here are: 

\vspace{-15pt}
\begin{minted}{console}
Allowed input transports are lat pad telnet rlogin nasi ssh.
Allowed output transports are lat pad telnet rlogin nasi ssh.
\end{minted}
\vspace{-10pt}

\noindent
The \textbf{Input Transport} refer to the methods via which we're allowed to login to the router whereas the \textit{output transports} are the methods we can use to login to another device from the router. To see all of the transports methods available we use:

\vspace{-15pt}
\begin{minted}{console}
sw1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
sw1(config)#line vty 0 6

sw1(config-line)#transport input ?
  all     All protocols
  lat     DEC LAT protocol
  nasi    NASI protocol
  none    No protocols
  pad     X.3 PAD
  rlogin  Unix rlogin protocol
  ssh     TCP/IP SSH protocol
  telnet  TCP/IP Telnet protocol
  udptn   UDPTN async via UDP protocol

\end{minted}
\vspace{-10pt}

\noindent
To only allow telnet and SSH, we use:

\vspace{-15pt}
\begin{minted}{console}
sw1(config-line)#transport input telnet ssh
sw1(config-line)#end
sw1#sh line vty 0
...
Allowed input transports are telnet ssh.
Allowed output transports are lat pad telnet rlogin nasi ssh.
...
\end{minted}
\vspace{-10pt}

\subsection{Logging in via telnet}
To login via telnet from another device, and see which vty we're using, we use the command: 

\vspace{-15pt}
\begin{minted}{console}
sw2>telnet 192.168.1.11
Trying 192.168.1.11 ... Open
...
sw1>sh line
   Tty Typ     Tx/Rx    A Modem  Roty AccO AccI   Uses   Noise  Overruns   Int
*    0 CTY              -    -      -    -    -      0       0     0/0       -
     1 AUX   9600/9600  -    -      -    -    -      0       0     0/0       -
*    2 VTY              -    -      -    -    -      2       0     0/0       -
     3 VTY              -    -      -    -    -      0       0     0/0       -
     4 VTY              -    -      -    -    -      0       0     0/0       -
...
sw1>
\end{minted}
\vspace{-10pt}

\noindent
Here we can see we are using VTY 2 for the telnet. 

\subsection{Keyboard Shortcuts for Telnet}
\noindent
\begin{center}
	\begin{tabular}{rl}
		\toprule
		\textbf{Short cut} &\textbf{Action} \\
		\midrule
		\verb|Ctrl + |\textbf{A}	&Jump to the start of the line\\
		\verb|Ctrl + |\textbf{E}	&Jump to the end of the line\\
		\verb|Ctrl + |\textbf{W}	&Delete previous word in the line\\
		\verb|Ctrl + |\textbf{X}	&Delete all characters before cursor.\\
		\verb|Ctrl + |\textbf{K}	&Delete all characters from cursor till end.\\
		\textbf{$\uparrow$ Arrow}	&Delete all characters before cursor.\\
		\textbf{$\downarrow$ Arrow}	&Delete all characters before cursor.\\
		\verb|Esc + |\textbf{B}	&Move cursor back 1 word.\\
		\verb|Esc + |\textbf{F}	&Move cursor forward 1 word.\\
		\bottomrule
	\end{tabular}
\end{center}

\subsection{History Buffer}
The history buffer contains the last 20 commands used by default. This can be viewed with: 

\vspace{-15pt}
\begin{minted}{console}
sw1#show history
  sh line
  conf t
  en
  conf t
  sh run
  sh ver | i up
  sh line status
  sh line
  sh controllers gigabitEthernet 0/0
  sh cont g 0/0 tab
  sh cont g 0/0 tabular
  sh diag
  sh line
  sh line vty 0
  conf t
  sh line vty 0
  sh ip int br
  sh run
  sh mem
  sh history
sw1#
\end{minted}
\vspace{-10pt}

\noindent
The size of the history buffer can be changed in the line configuration mode with:

\vspace{-15pt}
\begin{minted}{console}
sw1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
sw1(config)#line vty 0 6
sw1(config-line)#history size ?
  <0-256>  Size of history buffer

sw1(config-line)#history size 50
\end{minted}
\vspace{-10pt}

\noindent
Now the history buffer will store the last 50 commands. 

\subsection{IP Interface Connection Overview}
The \verb|show ip interface brief| command shows us the connection status of the interface, the IP address assigned to each interface and more. 

\vspace{-15pt}
\begin{minted}{console}
sw1#sh ip int brief
Interface              IP-Address      OK? Method Status                Protocol
GigabitEthernet0/0     unassigned      YES unset  up                    up
GigabitEthernet0/1     unassigned      YES unset  up                    up
GigabitEthernet0/2     unassigned      YES unset  up                    up
GigabitEthernet0/3     unassigned      YES unset  up                    up
Vlan1                  192.168.1.11    YES manual up                    up
\end{minted}
\vspace{-10pt}

\section{Enabling SSH Access}
\textbf{Secure SHell (\textit{SSH})}, unlike Telnet requires both a user-name and a password for authentication. This user-name-password can live either on an external authentication server, or locally, i.e., in the memory of the router itself. In addition, the router also needs to know which domain it's a part of. 

\subsection{Setting up User-name, password and domain name}

The \verb|username| and \verb|password| commands take care of creating an username and password, and can be used together on the same line. The domain name is set using \verb|ip domain-name| command. These have to be set in the global config mode:

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#username cisco password cisco
sw1(config)#ip domain-name somuvmnet.com
\end{minted}
\vspace{-10pt}

\noindent
The domain name is used in the creation and self-signing of the digital certificate. A public-private key pair is used to enforce authentication. They can be generated using the \verb|crypto key generate rsa|. Note that the mod size has to be $\geq$ 768 bits for SSH 2. 

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#crypto key generate rsa
The name for the keys will be: sw1.somuvmnet.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 1024
% Generating 1024 bit RSA keys, keys will be non-exportable...
[OK] (elapsed time was 0 seconds)

sw1(config)#
*Nov 12 01:57:14.624: %SSH-5-ENABLED: SSH 1.99 has been enabled
sw1(config)#
\end{minted}
\vspace{-10pt}

\noindent
Now we have to choose to use SSH version 2, using: 

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#ip ssh version 2
\end{minted}
\vspace{-10pt}

\noindent
Finally we need to tell the device where to find the username and password combination. In this case, it's going to be the device memory itself. Hence, we use the \verb|login local| command in the \textit{line config mode}. 

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#line vty 0 6
sw1(config-line)#login local
\end{minted}
\vspace{-10pt}

\subsection{Connecting via SSH}
Depending on the OS, just like the \verb|ping| command, the input options may vary for the \verb|ssh| command, but the premise remains the same. The following is the method to do this on an IOS terminal: 

\vspace{-15pt}
\begin{minted}{console}
sw2#ssh -l cisco 192.168.1.11
...
Password:
...
sw1>exit

[Connection to 192.168.1.11 closed by foreign host]
sw2#
\end{minted}
\vspace{-10pt}

\section{Viewing Version Information}
The \verb|show version| or \verb|sh ver| command shows us some critical information about the device itself. This includes the version of the IOS that's being used by the hardware - a critical piece of information when reporting issues to Cisco's TAC (Technical Assistance Centre). 

\vspace{-15pt}
\begin{minted}{console}
sw2#sh ver
Cisco IOS Software, ... Version 15.2(20170321:233949)
...
sw2 uptime is 6 hours, 33 minutes
...
Cisco IOSv () processor (revision 1.0) with 984321K/62464K bytes of memory.
...
1 Virtual Ethernet interface
4 Gigabit Ethernet interfaces
...

sw2#
\end{minted}
\vspace{-10pt}

\noindent
The command also shows the uptime of the switch, i.e., how long it's been running. Further it shows teh total amount of RAM, which in this case is $984321 + 62464$ KB of memory, i.e., $=1046785 KB \approx 1GB$ of RAM. The number and types of interfaces is also displayed. 

\section{Viewing Current Configuration}
To show the entirety of the running configuration, we use the \verb|show running-configuration| command, or \verb|sh run| for short. There's also the option of seeing specific lines in the configuration by keyword searching using output filters. 

\vspace{-15pt}
\begin{minted}{console}
sw1#sh run
Building configuration...

Current configuration : 3169 bytes
!
! Last configuration change at 02:12:13 UTC Mon Nov 12 2018
!
version 15.2
...
hostname sw1
...
!
username cisco password 0 cisco
...
!

sw1#sh run | i username
username cisco password 0 cisco
sw1#
\end{minted}
\vspace{-10pt}

\noindent
The second command above uses the \verb|| i| filter that only shows lines including the matching keyword. There are several more criteria, some of which are: 

\noindent
\begin{center}
	\begin{tabular}{rl}
		\toprule
		\textbf{Short cut} &\textbf{Action} \\
		\midrule
		\verb:<command> | i:	&Only show lines that \textbf{include} the keyword\\
		\verb:<command> | e:	&Only show lines that \textbf{exclude} the keyword\\
		\verb:<command> | b:	&\textbf{Begin} showing all lines from the first instance of the keyword\\
		\verb:<command> | s:	&Only show the \textbf{section} containing the keyword\\
		\verb:<command> | c:	&\textbf{Count} the number of lines matching the RegExp\\
		\bottomrule
	\end{tabular}
\end{center}

\noindent
Just like a normal pager in Linux, the output of the show run command is searchable in the format \verb|/<keyword>| where upon typing the \textit{keyword} after the \verb|/| character and pressing enter, the screen jumps to the first line containing the keyword. 

\vspace{-15pt}
\begin{minted}{console}
sw1#sh run
Building configuration...
...
username cisco password 0 cisco
no aaa new-model
!
/vty
filtering...
line vty 0 4
 password cisco
 login local
 history size 50
 transport input telnet ssh
line vty 5
 password cisco
 login local
 history size 50
 transport input telnet ssh
!
end

sw1#
\end{minted}
\vspace{-10pt}

\section{MAC Address (CAM) Table Examination}
The primary objective of a Layer 2 Switch is to learn which MAC addresses live off of which port and storing them in a table called Content Addressable Memory (CAM) or MAC Address table. 

Then, when it gets a packet destined for a certain MAC Address, it sends it along the corresponding port it looks up from the CAM table. If the address is unknown, it floods all the ports but the port from which the packet was received, in an effort to learn which port is associated with that MAC address and store it in the table, to aid in future lookups. 

The contents of the MAC address can be viewed with the \verb|show mac address-table| command: 

\vspace{-15pt}
\begin{minted}{console}
sw1#sh mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0cee.bab5.5f00    DYNAMIC     Gi0/0
   1    0cee.bacd.5000    DYNAMIC     Gi0/1
   1    0cee.bacd.5001    DYNAMIC     Gi0/0
Total Mac Addresses for this criterion: 3
\end{minted}
\vspace{-10pt}

\noindent
The reason there are multiple MAC addresses associated to a certain port is because that MAC address belongs to another switch through which multiple devices can be reachable. Since that switch connects us to those MAC addresses, i.e., is a direct path, the end-user MAC addresses are mapped to the port leading up to the switch. 

While our MAC addresses can be obtained beyond switches, they can't be obtained for devices beyond a router. The dynamic entries in the MAC address table can be aged-out/timed-out if no traffic was seen from that port in a certain time (by default 5mins). To see the ageing time, we use: 

\vspace{-15pt}
\begin{minted}{console}
sw1#show mac address-table aging-time
Global Aging Time:  300
Vlan    Aging Time
----    ----------
\end{minted}
\vspace{-10pt}

\noindent
There can also be statically mapped MAC addresses that aren't learned but hard-coded into the switch. 

\subsection{Adding a Static MAC Address}
We can add a static MAC Address mapping using: 

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#mac address-table static a820.6332.0087 vlan 1 interface gi 0/3
sw1(config)#end
sw1#sh mac address-table
          Mac Address Table
-------------------------------------------

Vlan    Mac Address       Type        Ports
----    -----------       --------    -----
   1    0cee.bab5.5f00    DYNAMIC     Gi0/0
   1    0cee.bacd.5000    DYNAMIC     Gi0/1
   1    0cee.bacd.5001    DYNAMIC     Gi0/0
   1    a820.6332.0087    STATIC      Gi0/3
Total Mac Addresses for this criterion: 4
sw1#
\end{minted}
\vspace{-10pt}

\noindent
This can be handy when we're troubleshooting and trying to ensure that the MAC address of a device has been learned off of the right port. 

\section{Setting the Hostname}
The hostname of a network device acts as the name of the device in the network, helping us easily identify the device. If we have multiple switches in a network, as is often the case, the hostname lets us quickly identify and distinguish the devices. We can change the hostname using: 

\vspace{-15pt}
\begin{minted}{console}
sw(config)#hostname sw1
sw1(config)#end
\end{minted}
\vspace{-10pt}

\noindent
The current hostname is displayed as the first word before the prompt.

\section{Setting the Enable Password} 
Since the \verb|Enable| command lets us configure the switch, we should set a password on it. We can do this using the \verb|enable password| command:

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#enable password cisco
sw1(config)#end
sw1#
*Nov 19 05:37:32.191: %SYS-5-CONFIG_I: Configured from console by console
sw1#disable
sw1>enable
Password:
sw1#
\end{minted}
\vspace{-10pt}

\noindent
This creates a password that's stored as clear-text in the running config. Anyone who can view the running config will be able to see it:

\vspace{-15pt}
\begin{minted}{console}
sw1#sh run | i cisco
enable password cisco
\end{minted}
\vspace{-10pt}

\noindent
To change this, we can store an encrypted password hash, using the \verb|enable secret| command. This has several options in terms of encryption algorithms: 

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#enable secret ?
  0      Specifies an UNENCRYPTED password will follow
  5      Specifies a MD5 HASHED secret will follow
  8      Specifies a PBKDF2 HASHED secret will follow
  9      Specifies a SCRYPT HASHED secret will follow
  LINE   The UNENCRYPTED (cleartext) 'enable' secret
  level  Set exec level password
\end{minted}
\vspace{-10pt}

\noindent
For example, the MD5 (Message Digest 5) algorithm when applied on a word will give us a 128-bit hash value, also called a \textit{digest}. For example, the MD5 digest of 'cat' is '\verb|D077F244DEF8A70E5EA758BD8352FCD8|'. When someone enters the password, the switch runs the MD5 hashing algorithm on it to get it's hash. If the digest matches that already stored in the memory for the password, then the user is granted access. There's no way to get the password directly from the hash, since the hash is like a fingerprint of the password instead of a scrambled up version of the password itself. We can use the \verb|enable secret| command (which uses MD5 as the default algorithm) as: 

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#enable secret somu
sw1(config)#end
sw1#sh run | i enable
enable secret 5 $1$/Rxb$NofwEzG6FNEc2v9TiU1VA1
enable password cisco
\end{minted}
\vspace{-10pt}

\noindent
The \verb|5| before the hash \verb|$1$/Rxb$NofwEzG6FNEc2v9TiU1VA1| tells us that it's a MD5 digest. There are other algorithms available as well:

\noindent
\begin{center}
	\begin{tabular}{rrm{0.73\textwidth}}
		\toprule
		\textbf{Type} &\textbf{Algorithm} &\textbf{Description} \\
		\midrule
		\textit{5} &\textbf{MD5}	& Default algorithm; produces 128bit hash; lesser security than the hashes below.\\
		\midrule
		\textit{8} &\textbf{PBKDF2}	&Uses a variant of \textbf{Password Based Key Derivation Function 2 (\textit{PBKDF2})}, that itself uses \textbf{SHA-256 (Secure Hashing Algorithm - 256)} to generate a 256-bit hash; more secure than MD5.\\
		\midrule
		\textit{9} &\textbf{SCRYPT}	&Pronounced "S-Crypt"; Like PBKDF2, but requires even more computational resources to crack. \\
		\bottomrule
	\end{tabular}
\end{center}

\noindent
To change the algorithm type while setting the secret we can use \verb|enable algorithm-type| : 

\vspace{-15pt}
\begin{minted}{console}
sw1(config)#enable algorithm-type ?
  md5     Encode the password using the MD5 algorithm
  scrypt  Encode the password using the SCRYPT hashing algorithm
  sha256  Encode the password using the PBKDF2 hashing algorithm

sw1(config)#enable algorithm-type sha256 secret cisco
sw1(config)#end
sw1#sh run | i enable
enable secret 8 $8$srB.hFoYl8uTbI$.h2H8Ux2Ie4F/qDgysbS43/RWT1aapN4rlNIA3/0YUc
\end{minted}
\vspace{-10pt}

\section{Setting the exec-timeout}
The default behaviour of the switch is to log out the user after a certain period of inactivity, so that no one gains access if an admin forgets to logout. This can be defined through the \verb|exec-timeout| command, followed by the number of minutes and seconds before time-out:

\vspace{-15pt}
\begin{minted}{console}
sw1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
sw1(config)#line con 0
sw1(config-line)#exec-timeout 5 30

\end{minted}
\vspace{-10pt}

\noindent
The above sets the execution time-out period to 5m 30s. To remove it, we can use either \verb|no exec-timeout| or \verb|exec-timeout 0 0|.

